[
    {
        "request": "How do electron holes in materials work",
        "response": [
            "positively charged defects and excess electrons · the positively charged defects create a surface-to-bulk electrostatic ﬁeld and potential · the electrostatic ﬁeld/potential induces band bending · the steep band bending depth proﬁle can conﬁne any charge carriers · the formerly unoccupied t2g conduction band follows the proﬁle of the electrostatic potential and bends be- low EF in the near-surface region, thus giving rise to conduction electrons · these extra conduction electrons are due to the excess electrons from the oxygen vacancies · the conduction electrons see the depth proﬁle of the electrostatic potential as a quantum well along the sur- face normal and they become conﬁned along this direc- tion · as the surface normal is the only direction of conﬁne- ment, conductions electrons are free to move only along a two-dimensional plane: in other words they form a 2DES · the spectroscopic ﬁngerprint of the 2DES are subbands with appreciable energy-momentum dispersion along any direction parallel to the surface plane, but at the same time with well-determined energy values due to quantum conﬁnement along the surface normal 5 The studies that signalled the discovery of a 2DES on STO(100) [21, 22] were however only the spark. Later research built on this knowledge and brought the ﬁeld into a more profound understanding. We will summarize these results giving emphasis to ARPES studies that followed various research paths: (i) the experimental observation of 2DES characteristics that remained elusive (e.g. many-body interactions, spin polarization, further details on the creation mechanism, on energy dispersion and on dimensionality). (ii) the investigation of STO surfaces with different orienta- tions. (iii) the generation of 2DES on different functional oxides. (iv) the demonstration of a device-friendly fabrication pro- tocol that may bridge the gap between ARPES studies and technological applications. B. 2DES at the bare surface of SrTiO3: towards a more detailed understanding In order to shed more light into the 2DES, the role of irra- diation in creating a metallic surface was further investigated. Plumb and coworkers observed that on increasing irradiation, the size of the experimental Fermi surface (and hence the car- rier density) saturates very quickly, while intensity continues increasing. They proposed that increasing intensity signals a larger portion of the sample becoming metallic and conclude that there are two stable conﬁgurations of STO(100): one in- sulating (no irradiation, no 2D carriers, no Fermi surface) and one with a ﬁxed density of metallic 2D carriers [38]. A later work by McKeown Walker et al. showed that there are not only two stable electronic conﬁgurations of STO(100) but that n2D can be continuously tuned as a function of the irradiation time (ﬂuence) and the photon energy [39]. The authors sug- gested a mechanism of vacancy creation based on early results on core hole decay via an Auger process [40, 41]. The mecha- nism involves ﬁve consecutive steps: (i) an impinging photon creates a Ti3p core hole, (ii) the core hole is ﬁlled by O2p elec- trons via an Auger process, (iii) after the removal of electrons O2−can change to O+, (iv) Coulomb repulsion from neigh- boring Ti4+",
            "following equations: (1) , (2) where the electric potential of electron cloud is given by . (3) Bunches, which are rigid Gaussian shape in transverse and are located equal spacing along s, are represented by their center of mass xp. FG is expressed by the Bassetti- Erskine formula. The electron cloud build-up is simulated by integrating the second equation for the motion of macro-electrons xe under xp=0. The initial condition of electrons, where and when electrons are created, is sketched in Figure 1. When beam pass through the chamber cross-section, electrons are created with an energy distribution. When an electron hits the wall, secondary electrons are produced with a probability. Figure 1: Electron cloud build-up model. The coupled bunch instability is studied by solving the two coupled equations (1) and (2). Coupled bunch instability in KEK-PF Progress of electron cloud effects in these 17 years (since 1995) started from the interpretation of an instability observed in KEK-Photon Factory. Very strong coupled-bunch instability had been observed since the positron storage had started. The threshold of the instability is very low 10-15mA. Either of positron or electron could be stored by changing the polarity of the magnets. The instability is observed only in positron storage. Figure 2 shows frequency spectrum for the instability published in [1]. The first electron cloud build- up code (PEI) is developed in 1995 [3], and the coupled bunch instability was interpreted as a wake effect of the electron cloud. The wake force was estimated by perturbation of the cloud due to a passage through of a shifted bunch [3]. Figure 3 shows the simulated wake force. The shape of wake force contains characteristic of the electron motion in the drift space. The wake force is the same direction as the shift of the bunch: namely, the bunch shift upper induces the wake force, by which following bunches near the shifted bunch are kicked upper. Namely, an upper shift of bunch, which induces electron motion toward upper direction, results upper force for following bunches. This feature is explained in Figure 4. This wake has the regular property as seen in [10]. Note the definition of the sign of the wake force is different. Growth rate for each mode is calculated by the wake force as follows, (4) The positive imaginary part of the frequency (Ωm) is the growth rate for m-th mode. Figure 5 shows unstable mode spectrum estimated by the simulated wake force. The growth rate is very fast, 0.3msec for m=250-300. The wake force (ω<hω0) with the regular property induces higher mode near the beam harmonic number. The corresponding frequency is (h-m-νy)f0, where h and f0 are beam harmonic number and revolution frequency, respectively. The growth rate and mode spectrum well agreed with the measurements. Figure 2: Unstable mode spectrum measured in KEK-PF [1]. Figure 3: Simulated wake force due to electron cloud in KEK-PF [3]. Figure 4: Wake force appearance due to electron cloud in drift space Figure 5: Unstable mode spectra due to the wake force in Figure 3 [3]. Coupled bunch instability in BEPC Experiments",
            "number of particles by cell greater than one, which is crucial to stabilize the solution of Poisson's equation in quasi-equilibrium regime. The 3D Poisson's equation is solved at each time step varying in the range 0.1-1 fs, according to the carrier concentration, i.e. the doping concentration. By applying periodic boundary conditions, i.e. each carrier exiting through a contact is re-injected at the other side with the same wave vector, the number of carriers is constant. To compute the majority electron mobility, N-type resistors are simulated including electrons only. To compute the minority electron mobility we simulate P-type resistors with a given small amount of electrons: if the number of holes required to balance the ion charges is 0 P we simulate 1.1× 0 P holes and 0.1× 0 P electrons to maintain the neutrality. The resulting electron mobility is plotted in Fig. 1 (symbols) as a function of doping concentration and compared to experimental results given in [19] (N-type Si, continuous line) and [20] (P-type Si, dashed line). A very good agreement is found between calculated and 5 experimental mobilities in both cases of majority and minority electrons. It should be noted that this atomistic transport model makes very simply the difference between attractive and repulsive impurities. This difference only results from the 3D solution of Poisson equation, i.e. from the long-range part of the electron-ion interaction. III. MOSFET SIMULATION The atomistic model of impurity interaction has been applied to study the effect of the discrete character of channel dopants in short-gate MOSFET. Our intention is not to perform a full statistical analysis of dopant fluctuations, but to evaluate the influence of some specific impurity positions in the inversion layer on electron transport and device characteristics. The basic structure of simulated devices is shown in Fig. 2. The channel length L and width W are 50 nm. The junction depth ZJ is 15 nm and the gate oxide thickness tox equals 1 nm. To generate the reference device the doping implantation steps have been simulated using a Monte Carlo model [21]. In N-type source and drain regions the simulated average distribution of arsenic is approximated by a continuous doping profile decreasing from 5×1019cm-3 at the surface to 1018cm-3 at the junction depth. The distribution of dopants is considered as a discrete distribution only in the channel, i.e. in the so-called \"active region\" of volume L×W×ZJ. The boron implantation steps were optimized to give a uniform average concentration of 1018cm-3 on a large depth. It yields about 37 discrete impurities in the active region. At depth higher than ZJ the boron distribution is considered as a continuous concentration approximated by a smooth function. This article deals with the effect of small changes in the distribution of some of the 37 discrete impurities within the active region and more precisely in the inversion layer, which led us to study fourteen additional devices to be compared to the reference. Unless otherwise indicated, all results shown below have been obtained for a drain voltage VDS of 0.6 V. For a doping concentration of 1018cm-3 the average"
        ]
    },
    {
        "request": "Explain how spin-background affects low-lying excitations",
        "response": [
            "their spin is down. This generates a net z-spin current in the y direction. The second contribution (the so-called “side-jump” mechanism18,22,23,24) is caused by the anomalous relationship between the physical and the canonical position operator (see Eq. (6) below). This again leads to a ﬁnite spin current in the y direction. The skew-scattering and side-jump contributions were widely discussed in the context of the anomalous Hall eﬀect18,19,20,22,23,24,25,26 in magnetic materials. The skew-scattering contribution was ﬁrst studied by Smit19,20 while the side-jump contribution was introduced by Berger22,23. The theory for both eﬀects has been also discussed recently in several excellent papers, both for the extrinsic13,16,27 and the intrinsic case.28,29,30,31 In this paper in addition to the previously considered skew-scattering and side-jump contributions, we also include the Coulomb interaction eﬀects. The main eﬀect of interactions on the spin transport originates from the friction between spin-up and spin-down electrons moving with diﬀerent drift velocities, the so called spin-Coulomb drag (SCD) eﬀect32,33,34. We show that while the spin-Hall conductivity associated with the side-jump term is independent of the strength of electron-electron interactions, the skew scattering part is reduced by the spin-Coulomb drag, so the absolute value of the spin Hall conductivity (and hence the spin Hall current) is reduced for experimentally accessible parameters. Since the SCD has been predicted (and recently observed35) to be a rather signiﬁcant contribution to the overall resistivity in high mobility electronic systems, we think it is important to include it in the description of the spin Hall eﬀect, and we show here how this is done. Moreover, we predict that SCD in paramagnetic materials will reduce the spin accumulations through the reduction of the skew-scattering resistivity as well as the spin diﬀusion length. Also, we present in the Appendix a simple model for electron-impurity scattering which can be solved exactly, leading to an analytical determination of scattering rates as well as side-jump and skew-scattering contributions to the spin Hall conductivity. 2 This paper is organized as follows: in Section II the Hamiltonian and the Boltzmann equation are presented; in Section III the skew-scattering contribution to the conductivity is derived; in Section IV we use a force-balance argument to calculate the side-jump contribution; in Section V the contributions of spin Coulomb drag and spin- ﬂip processes are included; in Section VI the spin accumulation in the presence of skew-scattering, side-jump, and electron-electron interactions is calculated. We summarize the paper in Section VII. II. HAMILTONIAN AND BOLTZMANN EQUATION We consider a strictly two-dimensional electron gas (2DEG) that lies in the x −y plane. The hamiltonian is H = H0 + Hso + Hc + HE , (1) where H0 = X i \u0014 p2 i 2m + Vei(⃗ri) \u0015 (2) is the non-interacting hamiltonian (m being the eﬀective mass of the conduction band), including the electric potential Vei(⃗r) generated by randomly distributed impurities, Hc = 1 2 X i̸=j e2 ǫb|⃗ri −⃗rj| , (3) is the electron-electron interaction (screened by the background dielectric constant ǫb), Hso = α X i n ⃗pi × h ⃗∇iVei(⃗ri) + ⃗∇iV i ee io · ⃗σi ,",
            "edge. It is not clear at present; whether, this sign of the spin accumulation is consistent or not with the sign of the Kerr rotation angle measured in the experiments10,11. VII. SUMMARY We have developed the microscopic theory of the extrinsic spin Hall eﬀect taking into account the skew-scattering, side-jump and Coulomb interaction eﬀects. The total spin conductivity in zero temperature is a sum of the skew- scattering and side-jump terms. The spin Coulomb drag is the only temperature dependent term, causing a quadratic- in-T reduction of the spin Hall conductivity. Further, we ﬁnd that the spin Hall conductivity associated with the side-jump contribution is independent of the strength of electron-electron interactions, while the part of the spin conductivity connected with the skew scattering is reduced by the spin-Coulomb drag for experimentally accessible mobilities. Moreover, we predict that in paramagnetic systems the spin-Coulomb drag reduces the spin accumulations in two diﬀerent ways: (i) directly through the reduction of the skew-scattering contribution (ii) indirectly through the reduction of the spin diﬀusion length. VIII. ACKNOWLEDGEMENTS This work was supported by NSF Grant No. DMR-0313681. We gratefully acknowledge valuable discussions with Shufeng Zhang, Shoucheng Zhang, Masaru Onoda and Roland Winkler. We thank Professors B. I. Halperin and E. Rashba for their criticism of an earlier version of this paper and for pointing out to us Ref.37. 12 ∗Electronic address: vignaleg@missouri.edu 1 S. A. Wolf, D. D. Awschalom, R. A. Buhrman, J. M. Du- aghton, S. von Molnar, M. L. Rouke, A. Y. Chtchelkanova, and D. M. Treger, Science 294, 1488 (2001). 2 M. I. Dyakonov and V. I. Perel, Phys. Lett.A 35, 459 (1971). 3 M. I. Dyakonov and V. I. Perel, Zh. Eksp. Ter. Fiz. 13, 657 (1971). 4 J. E. Hirsch, Phys. Rev. Lett. 83, 1834 (1999). 5 S. Zhang, Phys. Rev. Lett. 85, 393 (2000). 6 S. Murakami, N. Nagaosa, and S.-C. Zhang, Science 301, 1348 (2003). 7 J. Sinova, D. Culcer, Q. Niu, N. A. Sinitsyn, T. Jungwirth, and A. H. MacDonald, Phys. Rev. Lett. 92, 126603 (2004). 8 S. Murakami, cond-mat/0504353. 9 E. I. Rashba, Phys. Rev. B 68, 241315(R) (2003). 10 Y. K. Kato, R. C. Myers, A. C. Gossard, and D. D. Awschalom, Science 306, 1910 (2004). 11 V. Sih, R. C. Myers, Y. K. Kato, W. H. Lau, A. C. Gossard, and D. D. Awschalom, Nature Physics 1, 31 (2005). 12 J. Wunderlich, B. Kaestner, J. Sinova, and T. Jungwirth, Phys. Rev. Lett. 94, 047204 (2005). 13 H.-A. Engel, B. I. Halperin, and E. Rashba, cond- mat/0505535. 14 B. A. Bernevig and S.-C. Zhang, cond-mat/0412550. 15 B. K. Nikolic, S. Souma, L. P. Zarbo, and J. Sinova, cond- mat/0412595. 16 W.-K. Tso and S. D. Sarma, cond-mat/0502426. 17 W.-K. Tse, J. Fabian, I. Zutic, and S. D. Sarma, cond- mat/0508076. 18 P. Nozi´eres and C. Lewiner, J. Phys. (Paris) 34, 901 (1973). 19 J. Smit, Physica 21, 877 (1955). 20 J. Smit, Physica 24, 39 (1958). 21 N. F. Mott and H. S. W. Massey, The Theory of Atomic Collisions (Oxford University Press, 1964). 22 L. Berger,",
            "arXiv:cond-mat/0507228v4 [cond-mat.mes-hall] 7 Feb 2006 Coulomb corrections to the extrinsic spin-Hall eﬀect of a two-dimensional electron gas E. M. Hankiewicz and G. Vignale∗ Department of Physics and Astronomy University of Missouri, Columbia, Missouri 65211, USA (Dated: November 7, 2018) We develop the microscopic theory of the extrinsic spin Hall conductivity of a two-dimensional electron gas, including skew-scattering, side-jump, and Coulomb interaction eﬀects. We ﬁnd that while the spin-Hall conductivity connected with the side-jump is independent of the strength of electron-electron interactions, the skew-scattering term is reduced by the spin-Coulomb drag, so the total spin current and the total spin-Hall conductivity are reduced for typical experimental mobilities. Further, we predict that in paramagnetic systems the spin-Coulomb drag reduces the spin accumulations in two diﬀerent ways: (i) directly through the reduction of the skew-scattering contribution (ii) indirectly through the reduction of the spin diﬀusion length. Explicit expressions for the various contributions to the spin Hall conductivity are obtained using an exactly solvable model of the skew-scattering. PACS numbers: I. INTRODUCTION There has recently been a strong revival of interest in the phenomenon of the spin Hall eﬀect in the context of semiconductor spintronics1. Two diﬀerent forms of this phenomenon have been identiﬁed: an extrinsic spin-Hall eﬀect2,3,4,5, which is driven by spin-orbit scattering with impurities, and an intrinsic one6,7,8, which is due to spin- orbit eﬀects in the band structure. In both forms, the phenomenon consists of the appearance of a transverse spin current – say a z-spin current in the y-direction – when the electron gas is driven by an electric ﬁeld in the x-direction. The physical manifestations of this spin current are still an active subject of study and controversy.9 However, it is now believed that the spin Hall eﬀect should lead to transverse spin accumulation when the ﬂow of the spin current is suppressed by an appropriate gradient of spin-dependent electrochemical potential. Recently, the spin Hall eﬀect has been experimentally observed in Kerr rotation experiments in 3D and 2D n-doped GaAs10,11 and in a p-n junction light emitting diode (LED) realized in a two-dimensional hole system12. However, there is still a debate on the origin (extrinsic or intrinsic) of the experimentally observed spin accumulation.13,14,15,16,17 In this paper we focus exclusively on the theory of the extrinsic eﬀect in a two-dimensional electron gas (2DEG). It has long been realized that the extrinsic spin Hall current is the sum of two contributions18. The ﬁrst contribution (commonly known as “skew-scattering” mechanism19,20) arises from the asymmetry of the electron-impurity scattering in the presence of spin-orbit interactions21: electrons that are drifting in the +x direction under the action of an electric ﬁeld are more likely to be scattered to the left than to the right if, say, their spin is up, while the reverse is true if their spin is down. This generates a net z-spin current in the y direction. The second contribution (the so-called “side-jump” mechanism18,22,23,24) is caused by the anomalous relationship between the physical and the canonical position operator (see Eq. (6) below). This again leads to a ﬁnite spin current in the y"
        ]
    },
    {
        "request": "Explain the properties of metallic adatoms",
        "response": [
            "arXiv:1711.09828v1 [physics.app-ph] 27 Nov 2017 Electronic and magnetic properties of the graphene densely decorated with 3d metallic adatoms Ma lgorzata Wawrzyniak-Adamczewska Faculty of Physics, Adam Mickiewicz University, Umultowska 85, 61-614 Pozna´n, Poland E-mail: mwaw@amu.edu.pl Abstract. The electronic properties of graphene decorated with Ni, Co, Cu and Zn adatoms is studied with the density functional theory approach. Within the analysis the spin-orbit interaction is taken into account. We focus on the case when the indicated 3d metallic adatoms form a perfect, close-packed single-atomic layer above the graphene surface. The two conﬁgurations are examined, namely the adatoms in the on-top, and the hollow positions on graphene. First, we verify that the metallic adatoms in the close-packed structure do not form a covalent bonds with the graphene substrate. However, due to the proximity of the metallic adatoms to the graphene, the charge transfer from the adatom layer to the graphene takes place, and in consequence the graphene becomes n-doped. The observed charge transfer results from the arising hybridization between the graphene 2p and transition metal 3d orbitals. The proximity of metallic adatoms modiﬁes the magnetic state of the graphene. This eﬀect is especially pronounced for the decoration with magnetic atoms, when the magnetic moments on the graphene sublattices are induced. The analysis of the band structure demonstrates that the charge transfer, as well as the induced magnetism on graphene, modify the graphene electronic properties near high symmetry points, especially the Dirac cones. The presence of the metallic adatoms breaks graphene K −K ′ symmetry and splits the bands due to the exchange coupling. We show that for the hollow conﬁguration the gap opening arises at the K(K ′)-point due to the Rashba-like spin- orbit interaction, while in the case of the on-top conﬁguration the energy gap opens mainly due to the staggered potential. We also mapped the parameters of an eﬀective Hamiltonian on the results obtained with the density functional theory approach. 1. Introduction Graphene is one of the most prominent currently studied two dimensional material [1]. This stable single layer of carbon atoms forms a honeycomb lattice and possesses extraordinary electronic properties, i.e. a linear band dispersion for low energies near K and K ′ symmetry points. The exciting electronic properties of graphene originate from the fact that its structure consists of the two equivalent sublattices, with the assigned pseudospins [2, 3, 4]. 2 Since it is technologically inconvenient to obtain free standing graphene and incorporate it into electronic devices, the graphene growth on various substrates, as well as its decoration with various adatoms, or formation of the hetero-layered structures addresses much attention [5]-[20]. The structural incorporation of graphene with other materials may lead to the enhancement of the spin-orbit interaction, which destroys the perfect massless-relativistic picture for charge carriers and introduces the gap in the energy spectrum as well as a spin-splitting of the bands. This feature is desirable, if addressing the graphene as a part of the electronic devices for spin-dependent transport, spin-ﬁltering and magnetic valves. On the other hand, the unbounding of the graphene from substrates, e.g. by intercalation, in order",
            "in the ordinary surface or interface science, many physics and material science issues arise in considering the behavior of correlated electrons near surfaces and interfaces. Atomic reconstruction may occur, and may change the underlying electronic structure. For example, the authors of Ref. 3 argue that, in two-dimensional ruthenates, a change in tilt angle of the surface RuO6 octahedra increases the electronic hopping, thereby allowing the metallic phase to persist to lower T than in the bulk. Reduced coordination number at surfaces is supposed to enhance correlation eﬀects as discussed by Potthoﬀand Nolting,4, 5 Schwieger et al.,6 and Liebsch.7 Also, Hesper and co-workers have shown that the [111] surface of K3C60 diﬀers from the bulk. They noted that a change in structure will lead to changes in Madelung potentials, and to the screening which helps deﬁne the Further author information: (Send correspondence to S.O.) E-mail: okapon@phys.columbia.edu, Telephone: +1-212- 854-6712 values of many-body interaction parameters.8 Leakage of charge across an interface may change densities away from the commensurate values required for insulating behavior. On the experimental side, a variety of heterostructures have been fabricated and studied. For the surface, i.e., interface between a material and a vacuum, Maiti and collaborators have shown that the surface and bulk electronic phases of Ca1−xSrxVO3 are signiﬁcantly diﬀerent.9 They argued that the enhanced incoherent part of the photoemission spectra may be due to the reduced coordination number at the surface and/or surface recon- struction. Moore and collaborators have demonstrated that in the correlated electron system Ca1.9Sr0.1RuO4 (which exhibits a Mott metal-insulator transition), the surface layers remain metallic down to a lower tempera- ture than does the bulk system.3 We have proposed that in this system electron-lattice coupling is crucial for the Mott metal-insulator transition.10 Therefore, the surface Mott transition in these materials may be diﬀerent from that in the bulk; at the surface, due to the larger spring constant (estimated from the higher phonon frequency), electron-lattice coupling is reduced, and surface metal transition is suppressed. A variety of interfaces between diﬀerent materials includes high-Tc cuprates,11–13 Mott-insulator and band- insulator heterostructure,14 and superlattices of transition-metal oxides.15–21 Izumi and co-workers have fab- ricated digital heterostructures composed of diﬀerent transition metal oxides and have demonstrated changes in electronic phase and other properties depending on the thicknesses of diﬀerent layers.15 Warusawithana and collaborators fabricated and measured a variety of superlattices of dielectric materials with broken inversion symmetry.19 In an experimental tour-de-force, Ohtomo and co-workers have demonstrated the fabrication of atomically precise digital heterostructures involving a controllable number n of planes of LaTiO3 (a correlated- electron Mott-insulating material) separated by a controllable number m of planes of SrTiO3 (a more conventional band-insulating material) and have measured both the variation of electron density transverse to the planes and the dc transport properties of the heterostructure.14 Their work opens the door to controlled studies both of correlated electron physics in conﬁned dimensions and of the behavior of the interface between a correlated sys- tem and a uncorrelated one. Bowen and collaborators fabricated mangnites based tunneling magnetoresistance (TMR) junctions, and succeeded in obtaining the high spin",
            "lattice is indicated in the ﬁgure. The band structure for the pristine graphene is plotted with the purple line and presented in all ﬁgures for compartion. The ﬁgures show the course of the band structures obtained in the calculations where the Hubbard U corrections of the 3d metallic orbitals are or are not taken into account, as indicated. For the presented energy range, there is no much diﬀerence in the band structure between the hollow and the on-top conﬁgurations along reciprocal path for the particular considered 3d adatomic layer. The exception is the vicinity of the M-point, where the diﬀerence in the band structure for the conduction states between the hollow and the on-top cases is pronounced. This diﬀerence is especially pronounced for Ni, Co and Cu adatomic layers around 2 eV, and appears despite the treat of the Hubbard U corrections. The diﬀerence in the band structure course near the M-point is attributed to the fact that for the on-top conﬁguration the symmetry breaking appears in the reciprocal space near M-point on M–Γ path. At the presented energy range, the linear dispersion near K symmetry point is reproduced for all considered adatoms. However, the shift in energy of the Dirac point with respect to the Fermi Energy EF, here denoted by ED, appears. We attribute this shift to the strength and type of the hybridization between the graphene and adatomic layer. The n-doping type is observed for all studied adatoms, since the Dirac point of the considered systems is shifted below the Fermi energy. It is worth to underline, that taking into account the Hubbard corrections in the case of nickel layer is crucial, since it alters the graphne doping type, while for the zinc adatomic layer the modiﬁcation in the course of the band structure introduced by the Hubbard correction is unnoticeable in the presented energy range, despite the assumption of a quite large value of the U parameter. In general, the two groups of the adatoms among the studied ones may be distinguished. There are the adatoms that tend to hybridize strongly with the graphene, 6 Table 4. The values of shift of the Dirac point, ED in eV, for the indicated 3d adatoms in the hollow and on-top conﬁgurations. Ni Co Cu Zn on-top -0.9710 -0.5869 -0.1425 -0.9059 hollow -0.9824 -0.3329 -0.1718 -0.7170 and for them the shift of the Dirac point is signiﬁcant – these are nickel, cobalt and zinc, and the adatoms that can be regarded as weakly coupled to the graphene – the copper. The values of the shift in energy of the Dirac point ED for all considered adatoms are presented in Tab.4. Our observation of the graphene doping type stays in agreement with the previous studies of the graphene placed on the metallic substrates [26, 49]. One may also observe, that the set of ﬂat doping bands builds up below or/and around the Fermi energy. The position and spread in energy of the set of the doping bands depends on the adatom type. For the presented energy window the set of doping bands"
        ]
    },
    {
        "request": "Explain hole-spin qubits",
        "response": [
            "dot 1 and 2 (equivalent circuit shown in Fig. 12(b)) [6]. By sweeping P1 and P2 voltages, we can empty the holes in dot 1 and 2 to the very last (Fig. 12(c)). We correct the gate crosstalk by remapping P1 and P2 onto a virtual gate space, allowing separate control of the potential on dot 1 and 2 [7]. This is shown by the almost vertical and horizontal transition lines in Fig. 12(d). Furthermore, we demonstrate tunable inter-dot tunnel coupling in the single hole state (Fig. 13). This is required for robust two qubit gates [8]. We now access the spin qubit operations. We start with pMOS qubits, as the strong spin-orbit coupling (SOC) of holes allows electrical spin control without the need for extra structures such as stripline antennas or micromagnets [9]. We induce a double quantum dot system and tune it to weak tunnel coupling regime, similar to Fig. 11(c) bottom left. With increased |Vsd|, the conductance point expands to a bias triangle (Fig. 14). In some charge configurations, the bottom of the bias triangle could be missing, as shown in Fig. 14(a) right. This is due to Pauli spin blockade (PSB) as spins in the double dots form a triplet state that blocks the current flow (Fig. 14(b) right) [6]. In the PSB regime, we can readout the spin state, as higher current means one of the triplet spins has been flipped. With SOC, we control the spin by applying microwave (MW) burst to the quantum dot gate. When the MW frequency equals the spin Zeeman splitting by the magnet field, spins can be flipped, as shown in Fig. 15 [6]. Finally, we demonstrate coherent spin control with Rabi oscillations [9]. By sweeping the MW burst time, the spin oscillates up and down with a Rabi frequency ~ 18 MHz, as shown in Fig. 16(a). We further show the quadratic dependency of Rabi frequency with MW power, as the spin control speed is proportional to the MW amplitude (Fig. 16(b)). V. SUMMARY & FUTURE WORK Scaling up the qubit number and further improving the qubit performance are the main research focuses for silicon quantum dot qubit systems. We address them by developing a 300 mm process for qubit device integrations. Through this process, we incorporate different device designs, achieve highly uniform gates with 3σ ~ 5 nm, and demonstrate almost 100% device yield for 30 nm gate spacings. We further verify the process flow and device designs by cryogenic measurements, demonstrating well- defined single charges, highly tunable tunnel couplings, and coherent spin operations. Future efforts involve incorporating more materials and structures into the qubit devices in the fab process and improving cryogenic characterization throughputs by low temperature multiplexing and clever device designs. Through this learning cycle, knowledge on relevant material properties can be effectively collected, which will pave the way for large-scale silicon spin quantum processors. REFERENCES [1] L. M. K Vandersypen et al., npj Quantum Information 3, 34, 2017. [2] N. Moll et al., Quantum Sci. Technol. 3, 030503, 2018. [3] F. A. Mohiyaddin et al., Proc.",
            "for solving them. II. ARRAY DESIGN We propose a quantum computing architecture consisting of a two-dimensional array of electron-spin qubits using linear arrays of gate electrodes (Fig. 1) arranged to form a square lattice of electrostatically defined quantum dots with nearest- neighbor connectivity. In conventional spin qubit designs every quantum dot, with a typical pitch smaller than 100 nm, hosts a qubit. The proposed design uses a sparse qubit array with the qubits separated by ~12 μm and the vertices connected via electron shuttling channels to transport electrons to and from interaction regions. The array’s sparseness enables the integration of sample-and-hold circuits alongside the quantum dot circuitry allowing to offset the inhomogeneities in the potential landscape across the array by independent DC biasing while sharing the majority of control signals for qubit operations across the array. The latter allows for a significant reduction in the number of connections at the quantum plane boundary. As detailed in Fig. 2, we start from a 22 mm × 33 mm (726 mm2) die. The qubits are defined in the quantum plane, a section of the die consisting of 𝑀× 𝑀 modules, each containing 𝑁× 𝑁 unit cells. The unit cell is the smallest operational unit, containing four qubits along with all the elements required to operate them, as described in Fig. 3. Qubits remain at the vertices of the lattice while idle and are shuttled to the operation regions between the vertices in order to perform single- and two-qubit operations as well as readout and initialization. III. DC BIASING Fig. 4 shows circuit schematics of locally integrated sample- and-hold circuits providing individual DC biasing of all the control gates, which total 64 gates per unit cell. Gate voltages within a unit cell are updated sequentially via four local demultiplexers that each distribute DC voltages generated remotely (i.e., outside the quantum plane) to 16 local capacitors connected to the gates. All demultiplexers within a module share the same input DC biasing signal, and all demultiplexers in the quantum plane share the same address bus (see Fig. 4(f)). The demultiplexers are enabled sequentially and in turn sequentially update each gate. In this way, all modules are updated in parallel and therefore one module refresh cycle is required to refresh the entire qubit array. We define two bias voltage resolutions, based on the gate functionalities. Gates acting as barriers to shuttling channels only require a resolution sufficient to maintain an electron in a quantum dot and therefore we can afford a coarse resolution of 1 mV. All other plunger and barrier gates require a resolution of 1 μV [12]. The minimum hold capacitance required to achieve the coarse resolution is ~0.16 fF (limited by the electron charge 𝑒/∆𝑉), while the fine resolution requires ~14 pF (limited by thermal noise 𝑘𝐵𝑇/𝐶, assuming power dissipation from the local electronics raises the operating temperature to 1 K). The gate voltage refresh rate will be set by the current leakage of the hold circuit and the time required to update each gate, which in turn will set the module size (i.e., the",
            "hole and, therefore, have a substantial impact on the QP dispersion. The inclusion of these terms also helps in reproducing the suppression, as com- pared to (π/2,π/2), of the QP peak observed in ARPES at (π,0). However, nothing can be said about the line shape because the broadening is ar- tiﬁcially introduced in the theory, which is a ma- jor limitation of this kind of approach. Most im- portantly, it can be shown that the suppression of the QP peak at (π,0) reﬂects a reduction of AF spin correlations: the additional hopping possibil- ities represented by t′ and t′′ induce a spin-liquid state around the photo-hole with momentum (π,0) [33]. As a consequence, one may expect to ﬁnd in the ARPES results some signatures of spin-charge separation [9]. Within this context, it is interest- ing to note that the full QP dispersion observed for SCOC can be very well reproduced also by the spinon dispersion given in [34] [the dotted line in Fig. 4 shows the result along (π,0)-(0,π)]. In this case Laughlin argues in favor of the decay of the photo-hole injected in the 2D AF CuO2 plane into a spinon-holon pair [34], which is reminiscent of the ﬂux phase physics [35–40], an extension of the early resonating valence bond (RVB) conjecture [9]. The discussion of the ARPES result on insulat- ing SCOC emphasizes a fundamental problem in the theoretical description of the doped 2D AF: the Heisenberg model is so strongly perturbed by the addition of mobile holes that, above a certain dop- ing level, some form of spin liquid may be a bet- ter ansatz than the long range ordered N´eel state. This point is centrally important to high-Tc su- perconductivity because HTSCs, which are poor conductors in the normal state, may be better re- garded as doped AFs, whose behavior diﬀers fun- damentally from the FL paradigm. For this rea- son, the Bardeen-Cooper-Schrieﬀer (BCS) theory [41] which was developed for Fermi-liquid metals (i.e., weak electron correlations), and has been so successful in describing conventional superconduc- tors, does not have the appropriate foundation for HTSCs. A new approach may therefore be needed, and a necessary requirement for any theory aim- ing to capture the essential physics of high-Tc su- perconductivity must be the inclusion of the es- sential physics of the doped AF: the competition between AF and Coulomb interactions (which in- duce localization), and zero point kinetic energy (which favors delocalization). Along this direction, the most radical models seem to be those based on: (i) the RVB state and the related spin-charge separation picture [9,34–40,42–45], (ii) stripes [46– 57], and (iii) quantum criticality [58–63]. Indepen- dent of their details, these diﬀerent theoretical ap- proaches have one important common denomina- tor: superconductivity is not caused by the pairing of two QPs, as in the BCS case, rather it is the pro- cess in which the QP itself forms. Furthermore, in the ﬁrst two cases the driving mechanism for the superconducting phase transition is identiﬁed with the gain in kinetic energy, contrary to the standard theories of solids where any"
        ]
    },
    {
        "request": "Explain why it's hard to scale up quantum computers",
        "response": [
            "A sparse spin qubit array with integrated control electronics J. M. Boter1,2,*, J. P. Dehollain1,2,3,*, J. P. G. van Dijk1,2, T. Hensgens1,2, R. Versluis1,4, J. S. Clarke5, M. Veldhorst1,2, F. Sebastiano1, and L. M. K. Vandersypen1,2,5,† 1QuTech, Delft University of Technology, The Netherlands, 2 Kavli Institute of Nanoscience, Delft University of Technology, The Netherlands, 3School of Mathematical and Physical Sciences, University of Technology Sydney, Australia 4Netherlands Organisation for Applied Scientific Research (TNO), The Netherlands, 5Components Research, Intel Corporation, USA *These authors contributed equally to this work †Mail: Lorentzweg 1, 2628 CJ Delft, The Netherlands, l.m.k.vandersypen@tudelft.nl Abstract—Current implementations of quantum computers suffer from large numbers of control lines per qubit, becoming unmanageable with system scale up. Here, we discuss a sparse spin-qubit architecture featuring integrated control electronics significantly reducing the off-chip wire count. This quantum- classical hardware integration closes the feasibility gap towards a CMOS quantum computer. I. INTRODUCTION Semiconductor spin qubits [1, 2] are an attractive platform for large-scale quantum computers, due to their potential compatibility with well-established semiconductor manufacturing processes. In the last decade we have witnessed tremendous progress in the development of spin-qubit hardware [3-8] and significant interest and contribution of the semiconductor industry into spin-qubit research [9-11]. Therefore, the open questions surrounding the challenge of scaling-up [12] have become timely and highly relevant. One of the main issues in common with all nanoelectronic qubits is that current implementations require at least one external control line for every qubit. The small pitch of quantum dots (Fig. 1) permits extremely dense qubit arrays but aggravates the interconnect challenges. Existing proposals for dense 2D spin qubit arrays [13, 14] assume either a device density or material homogeneity that remains to be achieved. Another approach involves a network architecture, where qubits are arranged in small-cluster nodes, interconnected by long-range entanglement distribution channels, with the goal of creating space for easing the density requirements of the interconnects [12]. The feasibility of implementing quantum error correction protocols using this approach has been thoroughly analyzed [15], but the description of the physical implementation is largely missing. Here, we present a design of a sparse two- dimensional array whereby classical electronics integrated locally with the quantum hardware is used to minimize the need for off-chip interconnects and hence with a scalable Rent’s exponent [16]. We first describe the components of the array and the implementation of quantum gates and measurements, followed by a description of the control electronics required to operate the qubits in the array and correct errors via the surface code approach [17]. We then analyze how this implementation of locally integrated electronics reduces the number of connections at the quantum plane boundary, and the required footprint of such components. Finally we provide a discussion of some of the technological considerations, potential challenges and options for solving them. II. ARRAY DESIGN We propose a quantum computing architecture consisting of a two-dimensional array of electron-spin qubits using linear arrays of gate electrodes (Fig. 1) arranged to form a square lattice of electrostatically defined quantum dots with nearest- neighbor connectivity. In conventional spin qubit designs every quantum",
            "considering the clock rates of the system and the achievable operating temperature. It is most likely that both the surface code cycle rate and the size of the array will be limited by the number of sequential readouts required, since this is the most time consuming of all operations. Some degree of parallel readout can be implemented by amplitude modulation or frequency modulation. If that is not sufficient, smaller readout modules can be defined, each consisting of a subset of unit cells that are read sequentially. This comes at the expense of an increased number of readout connections. All things considered, this proposal provides an appealing outlook for the long-term implementation of larger scale quantum computing chips, and provides guidance for near- term research at the quantum, classical and integrated levels. REFERENCES [1] D. Loss, and D. P. DiVincenzo, Phys. Rev. A 57, 120 (1998). [2] F.A. Zwanenburg et al., Rev. Mod. Phys. 85, 961 (2013). [3] E. Kawakami et al., Nat. Nano 9, 666 (2014). [4] M. Veldhorst et al., Nat. Nano 9, 981 (2014). [5] J. Yoneda et al., Nat. Nano 13, 102 (2018). [6] T. F. Watson et al., Nature 555, 633 (2018). [7] X. Xue et al., Phys. Rev. X 9, 021011 (2019). [8] W. Huang et al., Nature 569, 532 (2019). [9] R. Maurand et al., Nat. Comm. 7, 13575 (2016). [10] P. Galy et al., IEEE J. of the Electron Devices Society 6, 594 (2018). [11] R. Pillarisetty et al., in 2018 IEEE Int. Elec. Dev. Meet. (IEDM) (IEEE, New York, 2018), pp. 6.3.1-6.3.4 [12] L. M. K. Vandersypen et al., npj Quantum Inf. 3, 34 (2017). [13] M. Veldhorst et al., Nat. Comm. 8, 1766 (2017). [14] R. Li et al., Sci. Adv. 4, eaar3960 (2018). [15] B. Buonacorsi et al., Quant. Sci. Tech. 4, 025003 (2019). [16] D. P. Franke et al., Microprocessors and Microsystems 67, 1 (2019). [17] C. Horsman et al., New J. of Phys. 14, 123011 (2012). [18] M. Pioro-Ladrière et al., Appl. Phys. Lett. 90, 024105 (2007). [19] J. M. Park et al., in 2015 IEEE Int. Elec. Dev. Meet. (IEDM) (IEEE, New York, 2015), pp. 26.5.1-26.5.4 Shuttling gates (blue) Source  gate Pulsed gates (red) DC: source  local demultiplexer  gate AC: source  gate Sensing dot plunger (purple) DC: source  local demultiplexer  gate AC: source  global demultiplexer  gate Drain contacts Measurement device  ohmic Table 1. Summary of signal routing for the four different type of control lines in the array design. Fig. 1: Image of a set of gate electrodes from a state-of-the-art device of electrostatically defined quantum dots. Fig. 2 Overview of the qubit architecture with a schematic breakdown of its components as described in the main text, including (a) the die containing (b) the quantum plane area, highlighting a single (c) module which contains a set of (d) unit cells. Qubits are color coded to distinguish data qubits (blue) and ancilla qubits (red), as defined in the surface code. Fig. 3 (a) Schematic of a unit cell containing four spin",
            "for solving them. II. ARRAY DESIGN We propose a quantum computing architecture consisting of a two-dimensional array of electron-spin qubits using linear arrays of gate electrodes (Fig. 1) arranged to form a square lattice of electrostatically defined quantum dots with nearest- neighbor connectivity. In conventional spin qubit designs every quantum dot, with a typical pitch smaller than 100 nm, hosts a qubit. The proposed design uses a sparse qubit array with the qubits separated by ~12 μm and the vertices connected via electron shuttling channels to transport electrons to and from interaction regions. The array’s sparseness enables the integration of sample-and-hold circuits alongside the quantum dot circuitry allowing to offset the inhomogeneities in the potential landscape across the array by independent DC biasing while sharing the majority of control signals for qubit operations across the array. The latter allows for a significant reduction in the number of connections at the quantum plane boundary. As detailed in Fig. 2, we start from a 22 mm × 33 mm (726 mm2) die. The qubits are defined in the quantum plane, a section of the die consisting of 𝑀× 𝑀 modules, each containing 𝑁× 𝑁 unit cells. The unit cell is the smallest operational unit, containing four qubits along with all the elements required to operate them, as described in Fig. 3. Qubits remain at the vertices of the lattice while idle and are shuttled to the operation regions between the vertices in order to perform single- and two-qubit operations as well as readout and initialization. III. DC BIASING Fig. 4 shows circuit schematics of locally integrated sample- and-hold circuits providing individual DC biasing of all the control gates, which total 64 gates per unit cell. Gate voltages within a unit cell are updated sequentially via four local demultiplexers that each distribute DC voltages generated remotely (i.e., outside the quantum plane) to 16 local capacitors connected to the gates. All demultiplexers within a module share the same input DC biasing signal, and all demultiplexers in the quantum plane share the same address bus (see Fig. 4(f)). The demultiplexers are enabled sequentially and in turn sequentially update each gate. In this way, all modules are updated in parallel and therefore one module refresh cycle is required to refresh the entire qubit array. We define two bias voltage resolutions, based on the gate functionalities. Gates acting as barriers to shuttling channels only require a resolution sufficient to maintain an electron in a quantum dot and therefore we can afford a coarse resolution of 1 mV. All other plunger and barrier gates require a resolution of 1 μV [12]. The minimum hold capacitance required to achieve the coarse resolution is ~0.16 fF (limited by the electron charge 𝑒/∆𝑉), while the fine resolution requires ~14 pF (limited by thermal noise 𝑘𝐵𝑇/𝐶, assuming power dissipation from the local electronics raises the operating temperature to 1 K). The gate voltage refresh rate will be set by the current leakage of the hold circuit and the time required to update each gate, which in turn will set the module size (i.e., the"
        ]
    }
]