{"chunk_index": 0, "chunk_text": "Yunfei (David) Bai, MASc \n \nCell: (905) 962-2557 | [baiyfei@hotmail.com] | [LinkedIn Profile: Yunfei Bai] | [GitHub: Yunfei Bai] \n \nPrincipal Data & ML Engineer | Hands-on Engineering Leader \n \nSummary of Qualifications \n \n● Accomplished Principal Engineer and hands-on technical leader with 10+ years of experience in architecting, \nbuilding, and scaling data-intensive machine learning applications and platforms from concept to production. \n● Proven expertise in end-to-end ML lifecycle and MLOps practices: leading the design of scalable data pipelines, \nfeature engineering, model development (NLP, Deep Learning), deployment (Docker, Kubernetes), monitoring, and \nCI/CD automation. \n● Deep technical proficiency in Big Data technologies (Spark, Databricks, Elasticsearch ELK stack), cloud platforms \n(AWS, RedHat OpenShift), and programming languages (Python, Scala, SQL) for high-volume data processing and \nanalytics. \n● Strong background in data engineering and architecture: designing enterprise data warehouses, developing complex \nETL/ELT processes, and building robust data governance and QA frameworks.  \n● Demonstrated ability to set technical direction, mentor high-performing engineering teams, and collaborate cross-\nfunctionally with data scientists, business leaders, and IT to translate complex business needs into innovative technical \nsolutions. \n● Holder of advanced certifications in Artificial Intelligence and Data Science from the University of Toronto,"}
{"chunk_index": 1, "chunk_text": "complementing a Master of Applied Science in computational modeling. \n \nProfessional Experience \n \nRoyal Bank of Canada (RBC) | Toronto, ON \nSenior Manager, TI IT Risk Analytics | Feb. 2023 – Present, Data Scientist | Mar 2020 – Jan 2023 \n \no Technical Leadership & Strategy: Led the end-to-end architecture, design, and development of a next-generation TI \nRisk Analytics platform from scratch. Defined the technical vision, selected technologies (Elasticsearch, \nKubernetes, Python), and established best practices for data engineering and MLOps. \no Hands-on Data & ML Engineering: Built and automated scalable data pipelines ingesting from 15+ sources \n(handling millions of records/daily) for KPI/KRI insights. Architected a centralized data repository and \nimplemented automated data validation and QA processes, improving data reliability and reducing manual effort by \n90%. \no End-to-End ML Product Development: Conceived, developed, and productionized multiple NLP and machine \nlearning models to address key business risks: \n• Change Risk Mitigator (Sage Avert) with AI Ops team: Led the development of an ML model integrated \nwith ServiceNow that predicts high-risk changes, reducing change-induced P1/P2 incidents from 8% to 2% \nand saving millions annually. \n• Role-Based Access Control (RBAC) Model: Architected an unsupervised learning algorithm to cluster \n88K+ entitlements into roles, automating access attestations and resulting in cost savings of ~$100K per"}
{"chunk_index": 2, "chunk_text": "implementation phase. \n• RCSA Classifier Model: Built and deployed an NLP classification model on OpenShift to automate the risk \ncategorization of 1000+ items, reducing a manual 2 expert task to a 15-minute automated process. \no Cross-Functional Partnership & Mentorship: Partnered with senior executives, risk teams, and IT to align projects \nwith strategic goals. Mentored and coached a team of data engineers and analysts on software engineering best \npractices, code reviews, and advanced data techniques. \n \nTools: Python, Keras, TensorFlow, Spark, Docker, Kubernetes, RedHat OpenShift, Elasticsearch ELK Stack, Git, Jira"}
{"chunk_index": 3, "chunk_text": "Bell Canada | Toronto, ON \nData Science Manager | Nov 2019 – Mar 2020, Data Science Developer | Jan 2017 – Nov 2019 \no Managed the portfolio and resources for a team of 5 senior developers on BI and ML projects, including Campaign \nIntelligence and Customer Personalization. \no Designed and implemented an automated Machine Learning Factory framework to operationalize predictive models. \nThis included creating data mart architectures, building ETL pipelines with SAS, and developing performance \nmonitoring dashboards in Tableau. \no Enabled the automated production scoring of models, significantly improving the speed from data -to-insight for \ncustomer experience analytics. \n \nTechnical Skills \n \n• Programming & Data: Python (Expert), Scala, Spark (SQL, MLlib), SQL (T -SQL, Teradata), SAS, Bash \n• Machine Learning: TensorFlow, Keras, Scikit-learn, NLP, Deep Learning, Reinforcement Learning, MLOps, Model \nDeployment & Monitoring \n• Big Data & Cloud Tech: Spark, Databricks, Elasticsearch ELK Stack, Kafka, Airflow, Docker, Kubernetes, RedHat \nOpenShift, AWS (S3, EC2, ECS) \n• Data Engineering: Data Warehousing, ETL/ELT, Data Modeling (Star/Snowflake Schema), Data Governance, Data \nPipelines \n• Tools & Platforms: Git, Jira, Tableau, Power BI \n \nCertification \n \nCertificate of Artificial Intelligence | University of Toronto | 2020 \n  · Intelligent Agents & Reinforcement Learning (95%), Deep Learning (94%) \nCertificate of Data Science | University of Toronto | 2019"}
{"chunk_index": 4, "chunk_text": "· Machine Learning (98%), Big Data Management (98%), Statistics (99%), Foundations of Data Science (94%)  \n \nEducation \n \nMaster of Applied Science (MASc) | McMaster University | Hamilton, ON | 2012"}
{"chunk_index": 5, "chunk_text": "GIULIA\nGONZALEZ\nPython Developer\nggonzalez@email.com\n(123) 456-7890\nDetroit, MI\nLinkedIn\nGithub\nEDUCATION\nM.S.\nComputer Science\nUniversity of Chicago\n2014 - 2016\nChicago, IL\nB.S.\nComputer Science\nUniversity of Pittsburgh\n2010 - 2014\nPittsburgh, PA\nSKILLS\nHTML/ CSS\nSQL (PostgreSQL, Oracle)\nJavaScript (Angular)\nPython (Django)\nREST APIs (GraphQL)\nAWS (Redshift, S3)\nGit\nWORK EXPERIENCE\nPython Developer\nDoorDash\nSeptember 2017 - current Detroit, MI\n· Worked on building new Angular components for the customer-\nfacing web app, which improved the time on page for the\naverage user by 2 minutes\n· Collaborated with an agile team of 6, and helped prioritize and\nscope feature requests to ensure that the biggest impact\nfeatures were worked on ﬁrst\n· Built extensive test coverage for all new features, which reduced\nthe number of customer complaints by 23%\n· Acquired and ingested data to build and maintain data pipelines\nthat led to discovering an opportunity for a new site feature,\nboosting revenue by 6%\n· Communicated with internal teams and stakeholders, working\nto determine solutions for the user experience\nPython Developer Intern\nKnewton\nApril 2016 - April 2017 Chicago, IL\n· Worked alongside another developer to implement RESTful APIs\nin Django that enabled internal analytics team to increase\nreporting speed by 24%\n· Using Selenium, built out a unit testing infrastructure for a client\nweb application that reduced the number of bugs reported by\nthe client by 11% month over month"}
{"chunk_index": 6, "chunk_text": "· Provided project updates to leadership team of 3, and oﬀered\nrecommendations for design\n· Diagnosed issues causing slow speeds in applications, and\ndocumented the process to making the database query system\nmore robust\n· Participated in writing scalable code with a team of 4 interns\nand 1 developer for applications for a math course\nPROJECTS\nCryptocurrency Price Tracker\nCreator\n· Incorporated API calls to several applications, and stored data\neﬃciently in PostgreSQL backend\n· Utilized D3.js to allow users to dynamically visualize price\nmovements over time periods of their choosing"}
